#Задача 1 
while True:
    print("Идём в книжный магазин.\nЕсть нужная книга?")
    a = input("Ответ:")
    if a == "Да":
        print("Книга куплена. Идём домой")
        break
#Задача 2
c = 0
while a < 3
    a = int(input("Введите чётное число: "))
    b = int(a)
    if c != 3:
        b % 2 == 0
    else:
        print("Ошибка, Введите чётное число")
    